---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.HostMirrored
source: html/7e5256ff-5025-9091-5056-c2261eadbc71.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.HostMirrored Property

If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration.

## Syntax (C#)
```csharp
public bool HostMirrored { get; set; }
```